seryi2035/stm32002/proj005cmakeC6T6/Core/src/main.c
#define DS18B20_H_
//--------------------------------------------------

//--------------------------------------------------
#define SKIP_ROM 0
#define NO_SKIP_ROM 1
//--------------------------------------------------
#define RESOLUTION_9BIT 0x1F
#define RESOLUTION_10BIT 0x3F
#define RESOLUTION_11BIT 0x5F
#define RESOLUTION_12BIT 0x7F
//--------------------------------------------------
void DelayMicro( uint32_t micros);
void port_init(void);
void port_initREAD(void);
uint8_t ds18b20_init(uint8_t mode);
void ds18b20_MeasureTemperCmd(uint8_t mode, uint8_t *commandID);
void ds18b20_ReadStratcpad(uint8_t mode, uint8_t *Data, uint8_t *commandID);
uint8_t ds18b20_GetSign(uint16_t dt);
float ds18b20_Convert(uint16_t dt);
uint8_t ds18b20_Reset(void);
//--------------------------------------------------
uint8_t LastDeviceFlag;
uint8_t LastDiscrepancy;
uint8_t LastFamilyDiscrepancy;
uint8_t ROM_NO[8];


int main(void) {

  uint32_t RTC_Counter01 = 0;
  uint32_t RTC_Counter02 = 0;
  uint32_t RTC_Counter03 = 0;
  uint32_t RTC_Counter04 = 0;
  uint32_t n = 0;
  uint8_t cifry[10]={0,0,0,0,0,0,0,0,0,0}; //для теста
  milisecondsfromSTART = 0;
  // Включить тактирование модулей управления питанием и управлением резервной областью
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);
  // Разрешить доступ к области резервных данных
  PWR_BackupAccessCmd(ENABLE);

  //uint16_t res003;
  SET_PAR[0] = 40; //адрес этого устройства 40 (modbus) 1-247

  GETonGPIO(); //B11-B1 PP B4 B4 IPU A7 IPU A6 IPD A5 IPU
  TIM2_init(); // мkс 0-19999 TIM2->CNT servo A1 A3
  TIM3_init();
  TIM4_init(); // мкс 0-19999 TIM4->CNT servo B6 B7 B9
  usart1_init(); //A9 PP RXD A10 TXD жёлый //RS232 A11 ResetBits //485     //USART 1 and GPIO A (9/10/11) ON A11pp A8invertA11
  port_init(); //B11 B10
  if (ds18b20_Reset == 1) {
    USARTSend("owOK\n\r");
    GPIO_SetBits(GPIOC, GPIO_Pin_13);
  }
  //OW_Init(); //usart2 А2 А3
  //dev001.port = GPIOA;
  //dev001.pin = GPIO_Pin_12;
  //dev001.humidity = 0;
  //dev001.temparature = 0;
  //for(millisec003delay_ms=0; millisec003delay_ms<= 7200000; millisec003delay_ms++);
  //dev001.pointtemparature = 0;
  //DHT11_init(&dev001, dev001.port, dev001.pin);
  GPIO_ToggleBits(GPIOC,GPIO_Pin_13);
  //GPIO_ResetBits(GPIOC, GPIO_Pin_13);   // C13 -- 0 VCC
  //GPIO_SetBits(GPIOC, GPIO_Pin_13);     // C13 -- 1 GDN set!
  uart1.delay=150; //modbus gap 9600
  uart1.rxtimer = 0;
  delay_ms(1000);
  GPIO_ToggleBits(GPIOC,GPIO_Pin_13);
  //GPIO_ResetBits(GPIOC, GPIO_Pin_13);   // C13 -- 0 VCC
  //GPIO_SetBits(GPIOC, GPIO_Pin_13);     // C13 -- 1 GDN set!
  atSTART();
  //oprosite();

  iwdg_init();


  while (1) {
    if (Coils_RW[8] == 0) {
          IWDG_ReloadCounter();
    }
    if(uart1.rxgap==1) {
          MODBUS_SLAVE(&uart1);
          net_tx1(&uart1);
    }

    if ( ((RTC_Counter02 = globalsecs)  - RTC_Counter01) >= 1) {
          //GPIO_ToggleBits(GPIOC,GPIO_Pin_13);
          //USART1Send485("test\r\n");
          RTC_Counter01 = RTC_Counter02;
          if ( (RTC_Counter02 - RTC_Counter03) >= 60) {
              n++;
              if (n > 6) {
                  if ((hold_reg.tmp_u16[24] - hold_reg.tmp_u16[25]) > 10) {
                      Coils_RW[8] = 1;
                  }
                }else if (n > 100) {
                  n = 0;
                }
              hold_reg.tmp_u16[24] = hold_reg.tmp_u16[24] + 1;
              RTC_Counter03 = RTC_Counter02;
              input_reg.tmp_u16[2] = (RTC_Counter02 / 3600) % 24;   //Number STM20hour   "hour [%d]"                 (gmod20_INreg)     {modbus="<[slave20_4:2]"}
              input_reg.tmp_u16[1] = (RTC_Counter02 / 60) % 60;     //Number STM20minute   "minute [:%d]"            (gmod20_INreg)     {modbus="<[slave20_4:1]"}
              input_reg.tmp_u16[0] = RTC_Counter02 % 60;            //Number STM20second  "seconds [:%d]"            (gmod20_INreg)     {modbus="<[slave20_4:0]"}
              input_reg.tmp_u16[3] = (RTC_Counter02 / (3600 * 24)); //Number STM20date  "date [%d]"                  (gmod20_INreg)     {modbus="<[slave20_4:3]"}
              COILtimerMINUTES(1, input_reg.tmp_u16[12], BKP_DR5, hold_reg.tmp_u16[28], BKP_DR9);   //B11     slave20_403:4       slave20_302:4
              COILtimerMINUTES(2, input_reg.tmp_u16[13], BKP_DR6, hold_reg.tmp_u16[29], BKP_DR10);  //B10     slave20_403:5       slave20_302:5
              COILtimerMINUTES(3, input_reg.tmp_u16[14], BKP_DR7, hold_reg.tmp_u16[30], BKP_DR11);  //B1      slave20_403:6       slave20_302:6
              COILtimerMINUTES(4, input_reg.tmp_u16[15], BKP_DR8, hold_reg.tmp_u16[31], BKP_DR12);  //B0      slave20_403:7       slave20_302:7

              BKP_WriteBackupRegister(BKP_DR13, hold_reg.tmp_u16[10]); //servo001min hold.u6[11] BKP_DR13
              BKP_WriteBackupRegister(BKP_DR14, hold_reg.tmp_u16[11]); //servo001max hold.u6[11] BKP_DR14
              BKP_WriteBackupRegister(BKP_DR15, hold_reg.tmp_u16[12]);
              BKP_WriteBackupRegister(BKP_DR16, hold_reg.tmp_u16[13]);
              BKP_WriteBackupRegister(BKP_DR17, hold_reg.tmp_u16[14]);
              BKP_WriteBackupRegister(BKP_DR18, hold_reg.tmp_u16[15]);
              BKP_WriteBackupRegister(BKP_DR19, hold_reg.tmp_u16[16]);
              BKP_WriteBackupRegister(BKP_DR20, hold_reg.tmp_u16[17]);
              BKP_WriteBackupRegister(BKP_DR21, hold_reg.tmp_u16[18]);
              BKP_WriteBackupRegister(BKP_DR22, hold_reg.tmp_u16[19]);
          }
          //ds18b20Value = schitatU16Temp("\x28\xee\xe8\x19\x17\x16\x02\xa1");
          //input_reg.tmp_float[9] = (float) (ds18b20Value / 16.0);   //Number STM20DS03f "DS01 floatTemp [%.2f °C]"   (gmod20_INreg)     {modbus="<[slave20_402:1]"}
          //input_reg.tmp_u16[4] = DHT11_read(&dev001);               //Number STM20DHTres "DHTstatus [%d]"            (gmod20_INreg)     {modbus="<[slave20_4:4]"}
          //if (input_reg.tmp_u16[4] == DHT11_SUCCESS) {
          //    input_reg.tmp_u16[5] = dev001.humidity;               //Number STM20DHThum "humidity [%d %%]"          (gmod20_INreg)     {modbus="<[slave20_4:5]"}
          //    input_reg.tmp_float[8] = ((float)dev001.temparature + (0.1 * dev001.pointtemparature) );
          //    //Number STM20DHTtemp "DHTtemp [%.1f °C]"  (gmod20_INreg)     {modbus="<[slave20_402:0]"}
          //  }
          input_reg.tmp_u16[11] = hold_reg.tmp_u16[27];             //Number STM20countPPRO  "ROcountPP [%d]"        (gmod20_INreg)     {modbus="<[slave20_4:11]"}
          hold_reg.tmp_u16[26] = hold_reg.tmp_u16[25];              //prov2
          input_reg.tmp_float[11] = (float) RTC_Counter01;          //Number STM20count "count [%.1f ]"              (gmod20_INreg)     {modbus="<[slave20_402:3]"}
          if (Coils_RW[9] != 0) {
              if (input_reg.tmp_i16[11] > 0) {
                  RTC_Counter02 = RTC_Counter02 + ((uint32_t)input_reg.tmp_i16[7]);
              } else {
                  input_reg.tmp_i16[11] = input_reg.tmp_i16[11] * (-1);
                  RTC_Counter02 = RTC_Counter02 + ((uint32_t)input_reg.tmp_i16[7]);
              }
              SETglobalsecs(RTC_Counter02);
              //res_ftable[5] = 0;
              Coils_RW[9] = 0;
          }
      if ( (RTC_Counter02 % 60) == 4 /*&& (RTC_Counter04 != RTC_Counter02)*/) {
        RTC_Counter04 = RTC_Counter02;
        //oprosite(); //OW opros
        ds18b20_MeasureTemperCmd(SKIP_ROM, 0);
        USARTSend("oprosheno\n\r");
              /*for(int i = 0;i < RX_BUF_SIZE - 1; i++) RX_BUF08[i] = (u8) RX_BUF[i];
              OW_Scan(RX_BUF08, 1);
              for(int i = 0;i < RX_BUF_SIZE - 1; i++) RX_BUF[i] = (char) RX_BUF08[i];
              //char cifry[10];*/
              //28eecda91916010c 001 \x28\xee\xcd\xa9\x19\x16\x01\x0c
              //28ee09031a160167 002 \x28\xee\x09\x03\x1a\x16\x01\x67 30cm провода(зелёный, пара синих)   28ee09031a160167
              //28ee30101a1601a0 003 \x28\xee\x30\x10\x1a\x16\x01\xa0 два кусочка провода
              //28228894dc 004 \x28\x22\x88\x94\x0\x0\x0\xdc
              //283e528833 005 \x28\x3e\x52\x88\x0\x0\x0\x33
              //28cf99940e 006 \x28\xcf\x99\x94\x0\x0\x0\xe
              //28c1cc97d2 007 \x28\xc1\xcc\x97\x0\x0\x0\xd2
              //282939972e 008 \x28\x29\x39\x97\x0\x0\x0\x2e
              //28567e94a2 009 \x28\x56\x7e\x94\x0\x0\x0\xa2
              //28df788868 010 \x28\xdf\x78\x88\x0\x0\x0\x68
              //28c25c889e 011 \x28\xc2\x5c\x88\x0\x0\x0\x9e
              //28d6039741 012 \x28\xd6\x3\x97\x0\x0\x0\x41
              //28134d94f6 013 \x28\x13\x4d\x94\x0\x0\x0\xf6
              //
      }
      if ( (RTC_Counter02 % 60) == 8 ) {
        //ds18b20Value = schitatU16Temp("\x28\xee\xcd\xa9\x19\x16\x01\x0c");
        ds18b20_ReadStratcpad(NO_SKIP_ROM, RX_BUF, "\x28\xee\xcd\xa9\x19\x16\x01\x0c");
        cifry[2] = get_ab_xFF(ds18b20Value % 16);
        cifry[1] = get_ab_xFF((ds18b20Value / 16) % 10);
        cifry[0] = get_ab_xFF((ds18b20Value / 160) % 10);
        //USARTSend(ROM_NO);
        sendaddrow();
        USARTSend("oprosheno001\n\r");
      }
      if ( (RTC_Counter02 % 60) == 12 ) {
        //ds18b20Value = schitatU16Temp("\x28\x13\x4d\x94\x00\x00\x00\xf6");
        ds18b20_ReadStratcpad(NO_SKIP_ROM,  RX_BUF, "\x28\x13\x4d\x94\x00\x00\x00\xf6");
        cifry[2] = get_ab_xFF(ds18b20Value % 16);
        cifry[1] = get_ab_xFF((ds18b20Value / 16) % 10);
        cifry[0] = get_ab_xFF((ds18b20Value / 160) % 10);
        //USARTSend(ROM_NO);
        sendaddrow();
        USARTSend("oprosheno013\n\r");
      }
      if ( (RTC_Counter02 % 60) == 16 ) {
        //ds18b20Value = schitatU16Temp("\x28\xd6\x03\x97\x00\x00\x00\x41");
        ds18b20_ReadStratcpad(NO_SKIP_ROM,  RX_BUF, "\x28\xd6\x03\x97\x00\x00\x00\x41");
        cifry[2] = get_ab_xFF(ds18b20Value % 16);
        cifry[1] = get_ab_xFF((ds18b20Value / 16) % 10);
        cifry[0] = get_ab_xFF((ds18b20Value / 160) % 10);
        //USARTSend(ROM_NO);
        sendaddrow();
        USARTSend("oprosheno012\n\r");

