seryi2035/stm32002/proj005cmakeC6T6/Core/src/main.c
      }
      if ( (RTC_Counter02 % 60) == 20 ) {
        //ds18b20Value = schitatU16Temp("\x28\xc2\x5c\x88\x0\x0\x0\x9e");
        ds18b20_ReadStratcpad(NO_SKIP_ROM,  RX_BUF, "\x28\xc2\x5c\x88\x0\x0\x0\x9e");
        cifry[2] = get_ab_xFF(ds18b20Value % 16);
        cifry[1] = get_ab_xFF((ds18b20Value / 16) % 10);
        cifry[0] = get_ab_xFF((ds18b20Value / 160) % 10);
        //USARTSend(ROM_NO);
        sendaddrow();
        USARTSend("oprosheno011\n\r");
        USARTSend("\n\r");
      }
    }

  }
}

void atSTART(void) {
  coilFROMback(); //######################################## coilFROMback();coilFROMback();coilFROMback(); BKP_DR2 BKP_DR1
  Coils_RW[8] = 0;

  //setCOILS(Coils_RW);
  //for(u8 i = 0; i < OBJ_SZ; i++) {
  //    input_reg.tmp_u32[i] = 0;
  //    hold_reg.tmp_u32[i] = 0;
  //  }


  hold_reg.tmp_u16[28] = BKP_ReadBackupRegister(BKP_DR9);
  hold_reg.tmp_u16[29] = BKP_ReadBackupRegister(BKP_DR10);
  hold_reg.tmp_u16[30] = BKP_ReadBackupRegister(BKP_DR11);
  hold_reg.tmp_u16[31] = BKP_ReadBackupRegister(BKP_DR12);

  hold_reg.tmp_u16[10] = BKP_ReadBackupRegister(BKP_DR13); //servo001min hold.u6[10] BKP_DR13
  hold_reg.tmp_u16[11] = BKP_ReadBackupRegister(BKP_DR14); //servo001max hold.u6[11] BKP_DR14
  //servo001max = hold_reg.tmp_u16[11];
  //servo001use = 900;
  //servo001min = hold_reg.tmp_u16[10];
  hold_reg.tmp_u16[12] = BKP_ReadBackupRegister(BKP_DR15);
  hold_reg.tmp_u16[13] = BKP_ReadBackupRegister(BKP_DR16);
  //servo002max = hold_reg.tmp_u16[13];
  //servo002use = 500;
  //servo002min = hold_reg.tmp_u16[12];
  hold_reg.tmp_u16[14] = BKP_ReadBackupRegister(BKP_DR17);
  hold_reg.tmp_u16[15] = BKP_ReadBackupRegister(BKP_DR18);
  //servo003max = hold_reg.tmp_u16[15];
  //servo003use = 1000;
  //servo003min = hold_reg.tmp_u16[14];
  hold_reg.tmp_u16[16] = BKP_ReadBackupRegister(BKP_DR19);
  hold_reg.tmp_u16[17] = BKP_ReadBackupRegister(BKP_DR20);
  //servo004max = hold_reg.tmp_u16[17];
  //servo004use = 1000;
  //servo004min = hold_reg.tmp_u16[16];
  hold_reg.tmp_u16[18] = BKP_ReadBackupRegister(BKP_DR21);
  hold_reg.tmp_u16[19] = BKP_ReadBackupRegister(BKP_DR22);
  //servo005max = hold_reg.tmp_u16[19];
  //servo005use = 1000;
  //servo005min = hold_reg.tmp_u16[18];
  //WATER COUNT
  hold_reg.tmp_u16[8] = BKP_ReadBackupRegister(BKP_DR27);
  hold_reg.tmp_u16[9] = BKP_ReadBackupRegister(BKP_DR28);
  setCOILS(Coils_RW);

waterplus=0;
waterpluscount=0;
waterplusSET=1;
}

void COILtimerMINUTES (uint8_t coilSETED, uint16_t inREGcount,uint16_t inREGbkp, uint16_t holdREGtimer ,uint16_t holdREGbkp) {
  inREGcount = BKP_ReadBackupRegister(inREGbkp);

  if ( Coils_RW[coilSETED] != 0) {
      inREGcount--;
    } else {
      inREGcount = holdREGtimer;
    }
  if (inREGcount < 1) {
      Coils_RW[coilSETED] = 0;
    }
  BKP_WriteBackupRegister(inREGbkp, inREGcount);
  BKP_WriteBackupRegister(holdREGbkp, holdREGtimer);
}


void GETonGPIO() { //PP B(11/10/1/0) C13 A(7/6) | IPU B4 | IPD B8 FLOAT B9
  GPIO_InitTypeDef GPIO_InitStructure;
  //LED C.13
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

  //A6 PP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  // ///////// 4 OUT B11 B10 B1 B0
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
  // B11 PP
  /*GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  //B 10 PP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);*/
  // B1 PP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  //B 0 PP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  //KNOPKA B3 IPU
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  //RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  // A7 IPU
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  // A6 IPU
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  // A5 IPU
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  //KNOPKA B4 IPU
  //RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

}
void usart1_init(void) { //USART 1 and GPIO A (9/10/11) ON A11pp
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA, ENABLE);
  //NVIC
  NVIC_InitTypeDef NVIC_InitStructure;
  NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  //GPIO
  GPIO_InitTypeDef GPIO_InitStructure;
  //  A 9 TX
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  //  A 10 RX
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  //GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  // A11 PP
  GPIO_InitStructure.GPIO_Pin = USART1PPpin;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(USART1PPport, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  //  USART 1
  USART_InitTypeDef USART_InitStructure;

