seryi2035/stm32002/proj005cmakeC6T6/Core/src/main.c
  coilTOback();
}
void read_Discrete_Inputs_RO(void)
{

  if(GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_13) != (uint8_t)Bit_SET) { Discrete_Inputs_RO[0] = 1; }else{ Discrete_Inputs_RO[0] = 0;}
  //GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_11) == (uint8_t)Bit_SET ? Discrete_Inputs_RO[1] = 1 : Discrete_Inputs_RO[1] = 0;
  //if(GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_11) == (uint8_t)Bit_SET) { Discrete_Inputs_RO[1] = 1; }else{ Discrete_Inputs_RO[1] = 0;}
  //if(GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_10) == (uint8_t)Bit_SET) { Discrete_Inputs_RO[2] = 1; }else{ Discrete_Inputs_RO[2] = 0;}
  if(GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_1)  == (uint8_t)Bit_SET) { Discrete_Inputs_RO[3] = 1; }else{ Discrete_Inputs_RO[3] = 0;}
  if(GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_0)  == (uint8_t)Bit_SET) { Discrete_Inputs_RO[4] = 1; }else{ Discrete_Inputs_RO[4] = 0;}
  if(GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_8)   == (uint8_t)Bit_SET) { Discrete_Inputs_RO[5] = 1; }else{ Discrete_Inputs_RO[5] = 0;}
  //GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_4) == (uint8_t)Bit_SET ? Discrete_Inputs_RO[6] = 1; : Discrete_Inputs_RO[6] = 0;
  if(GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_4)   == (uint8_t)Bit_SET) { Discrete_Inputs_RO[6] = 1; }else{ Discrete_Inputs_RO[6] = 0;}
  //Discrete_Inputs_RO[6] = 1;
  //GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_5) == (uint8_t)Bit_SET ? Discrete_Inputs_RO[7] = 1; : Discrete_Inputs_RO[7] = 0;
  //if(GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_9)   == (uint8_t)Bit_SET) { Discrete_Inputs_RO[7] = 1; }else{ Discrete_Inputs_RO[7] = 0;}
  if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_7)   == (uint8_t)Bit_SET) { Discrete_Inputs_RO[8] = 1; }else{ Discrete_Inputs_RO[8] = 0;}
  if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_6)   == (uint8_t)Bit_SET) { Discrete_Inputs_RO[9] = 1; }else{ Discrete_Inputs_RO[9] = 0;}
  if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_5)   == (uint8_t)Bit_SET) { Discrete_Inputs_RO[10] = 1; }else{ Discrete_Inputs_RO[10] = 0;}
  Discrete_Inputs_RO[7] = 0;
  for(u8 i = 11; i < 16; i++) {
      Discrete_Inputs_RO[i] = 0;
    }
  for(u8 i = 16; i < 32; i++) {
      Discrete_Inputs_RO[i] = Discrete_Inputs_RO[i-16];
    }
}

/*void startCOILS(uint8_t *Coils_RW) {
  for(u8 i = 0; i < 32; i++) {
      Coils_RW[i] = 0;
    }
}*/
void read_Coils_RW(void) {
  if(GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_13) != (uint8_t)Bit_SET) { Coils_RW[0] = 1; }else{ Coils_RW[0] = 0;}
  //GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_11) == (uint8_t)Bit_SET ? Coils_RW[1] = 1 : Coils_RW[1] = 0;
  if(GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_11) == (uint8_t)Bit_SET) { Coils_RW[1] = 1; }else{ Coils_RW[1] = 0;}
  if(GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_10) == (uint8_t)Bit_SET) { Coils_RW[2] = 1; }else{ Coils_RW[2] = 0;}
  if(GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_1)  == (uint8_t)Bit_SET) { Coils_RW[3] = 1; }else{ Coils_RW[3] = 0;}
  if(GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_0)  == (uint8_t)Bit_SET) { Coils_RW[4] = 1; }else{ Coils_RW[4] = 0;}
  if(GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_8)   == (uint8_t)Bit_SET) { Coils_RW[5] = 1; }else{ Coils_RW[5] = 0;}
  //GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_4) == (uint8_t)Bit_SET ? Coils_RW[6] = 1; : Coils_RW[6] = 0;
  if(GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_4)   == (uint8_t)Bit_SET) { Coils_RW[6] = 1; }else{ Coils_RW[6] = 0;}
  //Coils_RW[6] = 1;
  //GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_5) == (uint8_t)Bit_SET ? Coils_RW[7] = 1; : Coils_RW[7] = 0;
  //if(GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_9)   == (uint8_t)Bit_SET) { Coils_RW[7] = 1; }else{ Coils_RW[7] = 0;}
  Coils_RW[7] = 0;

  for(u8 i = 16; i < 32; i++) {
      Coils_RW[i] = Coils_RW[i-16];
    }
  coilTOback();
  setCOILS(Coils_RW);
}
void TX_05(UART_DATA *MODBUS) {
  uint16_t tmp,tmp1;
  //MODBUS->buffer[0] =SET_PAR[0]; // adress - stays a same as in received
  //MODBUS->buffer[1] = 5; //query type - - stay a same as in recived
  //2-3  -  address
  tmp=(uint16_t)((MODBUS->buffer[2]<<8)+MODBUS->buffer[3]); // адрес
  //4-5 - значение 0xff00 ON / 0x0000 OFF
  tmp1=(uint16_t)((MODBUS->buffer[4]<<8)+MODBUS->buffer[5]);
  //если нас устраивает
  //tmp = tmp - 1; //                  как-то ТАК :///////////////////////////////
  if(tmp <= 32) {
      if (tmp1 == (uint16_t) 0xff00) {
          Coils_RW[tmp] = 1;
        } else if (tmp1 == 0x0000) {
          Coils_RW[tmp] = 0;
        } else {
          TX_EXCEPTION(MODBUS,0x03);
        }
      //подготовим к отправке
      MODBUS->buffer[2] = (uint8_t) (tmp>>8); //#################    надеюсь поможет
      MODBUS->txlen=(uint8_t) (8); //responce length
    }
  else  {
      //exception illegal data adress 0x02
      TX_EXCEPTION(MODBUS,0x02);
    }
  setCOILS(Coils_RW);
}
void TX_04(UART_DATA *MODBUS) {  //Read Input Registers
  uint16_t tmp,tmp1;
  uint8_t m=0,n=0;
  uint16_t tmp_val;

  //MODBUS->buffer[0] =SET_PAR[0]; // adress - stays a same as in received
  //MODBUS->buffer[1] = 3; //query type - - stay a same as in recived
  //MODBUS->buffer[2] = data byte count

  //2-3  - starting address
  tmp=((((uint16_t)MODBUS->buffer[2])<<8)+MODBUS->buffer[3]); //стратовый адрес для чтения
  //4-5 - number of registers
  tmp1=((((uint16_t)MODBUS->buffer[4])<<8)+MODBUS->buffer[5]);//количество регистров для чтения
  //default answer length if error
  n=3;

  //если нас устраивает длина запроса и и стартовый адрес
  if(((tmp+tmp1) < OBJ_SZ) && (tmp1 < MODBUS_WRD_SZ+1)) {
      for(m=0;m<tmp1;m++)    {
          tmp_val=input_reg.tmp_u16[m+tmp];//читаем текущее значение uint16_t
          MODBUS->buffer[n]=(uint8_t) (tmp_val>>8);
          MODBUS->buffer[n+1]=(uint8_t) tmp_val;
          n=n+2;
        }
      //запишем длину переменных пакета в байтах и вставим всообщение
      MODBUS->buffer[2]=m * 2; //byte count
      //подготовим к отправке
      MODBUS->txlen=m * 2 + 5; //responce length
    } else {
      //exception illegal data adress 0x02
      TX_EXCEPTION(MODBUS,0x02);
    }
}
void TX_03(UART_DATA *MODBUS) {
  uint16_t tmp,tmp1, tmp_val = 0;
  uint16_t m=0,n=0;
  //MODBUS->buffer[0] =SET_PAR[0]; // adress - stays a same as in received
  //MODBUS->buffer[1] = 3; //query type - - stay a same as in recived
  //MODBUS->buffer[2] = data byte count
  //2-3  - starting address
  tmp=((((uint16_t)MODBUS->buffer[2])<<8)+MODBUS->buffer[3]); //стратовый адрес для чтения
  //4-5 - number of registers
  tmp1=((((uint16_t)MODBUS->buffer[4])<<8)+MODBUS->buffer[5]);//количество регистров для чтения
  //default answer length if error
  n=3;

  //если нас устраивает длина запроса и и стартовый адрес
  if((((tmp+tmp1)<OBJ_SZ*2) && (tmp1<MODBUS_WRD_SZ+1)))    {
      for(m=0;m<tmp1;m++)    {
          tmp_val=hold_reg.tmp_u16[m+tmp];//читаем текущее значение uint16_t
          MODBUS->buffer[n]=(uint8_t) (tmp_val>>8);
          MODBUS->buffer[n+1]=(uint8_t) tmp_val;
          n=n+2;
        }
      //запишем длину переменных пакета в байтах и вставим всообщение
      MODBUS->buffer[2]=(uint8_t) (m*2); //byte count
      //подготовим к отправке
      MODBUS->txlen=(uint8_t) (m*2+5); //responce length
    } else {
      //exception illegal data adress 0x02
      TX_EXCEPTION(MODBUS,0x02);
    }
}
void TX_06(UART_DATA *MODBUS) {
  uint16_t tmp;

  //MODBUS[0] =SET_PAR[0]; // adress - stays a same as in recived
  //MODBUS[1] = 6; //query type - - stay a same as in recived
  //2-3  - adress   , 4-5 - value
  tmp=(uint16_t)((MODBUS->buffer[2]<<8)+MODBUS->buffer[3]); //adress
  //MODBUS->buffer[2]  - byte count a same as in rx query

  if(tmp<OBJ_SZ)  {
      hold_reg.tmp_u16[tmp] =((((uint16_t)MODBUS->buffer[4])<<8)+MODBUS->buffer[5]);

      MODBUS->txlen=MODBUS->rxcnt; //responce length
    }
  else
    {
      //illegal data
      TX_EXCEPTION(MODBUS,0x02) ;
    }

