seryi2035/stm32002/proj005cmakeC6T6/Core/src/main.c
  while (cLen > 0) {

      OW_toBits(*command, ow_buf);
      command++;
      cLen--;

      OW_SendBits(8);

      // если прочитанные данные кому-то нужны - выкинем их в буфер
      if (readStart == 0 && dLen > 0) {
          *data = OW_toByte(ow_buf);
          data++;
          dLen--;
        } else {
          if (readStart != OW_NO_READ) {
              readStart--;
            }
        }
    }

  return OW_OK;
}
uint8_t OW_Scan(uint8_t *buf, uint8_t num) {


//-----------------------------------------------------------------------------
// Данная функция осуществляет сканирование сети 1-wire и записывает найденные
//   ID устройств в массив buf, по 8 байт на каждое устройство.
// переменная num ограничивает количество находимых устройств, чтобы не переполнить
// буфер.
//-----------------------------------------------------------------------------
  uint8_t found = 0;
  uint8_t *lastDevice;
  uint8_t *curDevice = buf;
  uint8_t numBit, lastCollision, currentCollision, currentSelection;

  lastCollision = 0;
  while (found < num) {
      numBit = 1;
      currentCollision = 0;

      // посылаем команду на поиск устройств
      OW_Send(OW_SEND_RESET, (uint8_t*)"\xf0", 1, 0, 0, OW_NO_READ);

      for (numBit = 1; numBit <= 64; numBit++) {
          // читаем два бита. Основной и комплементарный
          OW_toBits(OW_READ_SLOT, ow_buf);
          OW_SendBits(2);

          if (ow_buf[0] == OW_R_1) {
              if (ow_buf[1] == OW_R_1) {
                  // две единицы, где-то провтыкали и заканчиваем поиск
                  return found;
                } else {
                  // 10 - на данном этапе только 1
                  currentSelection = 1;
                }
            } else {
              if (ow_buf[1] == OW_R_1) {
                  // 01 - на данном этапе только 0
                  currentSelection = 0;
                } else {
                  // 00 - коллизия
                  if (numBit < lastCollision) {
                      // идем по дереву, не дошли до развилки
                      if (lastDevice[(numBit - 1) >> 3]
                          & 1 << ((numBit - 1) & 0x07)) {
                          // (numBit-1)>>3 - номер байта
                          // (numBit-1)&0x07 - номер бита в байте
                          currentSelection = 1;

                          // если пошли по правой ветке, запоминаем номер бита
                          if (currentCollision < numBit) {
                              currentCollision = numBit;
                            }
                        } else {
                          currentSelection = 0;
                        }
                    } else {
                      if (numBit == lastCollision) {
                          currentSelection = 0;
                        } else {
                          // идем по правой ветке
                          currentSelection = 1;

                          // если пошли по правой ветке, запоминаем номер бита
                          if (currentCollision < numBit) {
                              currentCollision = numBit;
                            }
                        }
                    }
                }
            }

          if (currentSelection == 1) {
              curDevice[(numBit - 1) >> 3] |= 1 << ((numBit - 1) & 0x07);
              OW_toBits(0x01, ow_buf);
            } else {
              curDevice[(numBit - 1) >> 3] &= ~(1 << ((numBit - 1) & 0x07));
              OW_toBits(0x00, ow_buf);
            }
          OW_SendBits(1);
        }
      found++;
      lastDevice = curDevice;
      curDevice += 8;
      if (currentCollision == 0)
        return found;

      lastCollision = currentCollision;
    }

  return found;

}
uint8_t OW_Reset(void) {
  uint16_t status=0;

  //(на всякий случай подождём побольше, так как могут быть неточности в задержке)
  return (status);//вернём результат
}
void OW_SendBits(uint8_t num_bits) {

}
void OW_toBits(uint8_t ow_byte, uint8_t *ow_bits) {

//-----------------------------------------------------------------------------
// функция преобразует один байт в восемь, для передачи через USART
// ow_byte - байт, который надо преобразовать
// ow_bits - ссылка на буфер, размером не менее 8 байт
//-----------------------------------------------------------------------------
        uint8_t i;
        for (i = 0; i < 8; i++) {
                if (ow_byte & 0x01) {
                        *ow_bits = OW_1;
                } else {
                        *ow_bits = OW_0;
                }
                ow_bits++;
                ow_byte = ow_byte >> 1;
        }
}
uint8_t OW_toByte(uint8_t *ow_bits) {


//-----------------------------------------------------------------------------
// обратное преобразование - из того, что получено через USART опять собирается байт
// ow_bits - ссылка на буфер, размером не менее 8 байт
//-----------------------------------------------------------------------------
        uint8_t ow_byte, i;
        ow_byte = 0;
        for (i = 0; i < 8; i++) {
                ow_byte = ow_byte >> 1;
                if (*ow_bits == OW_R_1) {
                        ow_byte |= 0x80;
                }
                ow_bits++;
        }

        return ow_byte;
}



void DelayMicro( uint32_t micros)
{
micros *= (SystemCoreClock / 1000000) / 9;
/* Wait till done */
while (micros--) ;
}
//--------------------------------------------------
void port_init(void)
{
  //HAL_GPIO_DeInit(GPIOB, GPIO_PIN_11);
  GPIO_InitTypeDef GPIO_InitStructure;
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
  // B11 PP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  /*GPIOB->CRH |= GPIO_CRH_MODE11;
  GPIOB->CRH |= GPIO_CRH_CNF11_0;
  GPIOB->CRH &= ~GPIO_CRH_CNF11_1;*/
}
void port_initREAD(void)
{
  //HAL_GPIO_DeInit(GPIOB, GPIO_PIN_11);
  GPIO_InitTypeDef GPIO_InitStructure;
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
  // B11 PP
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  /*GPIOB->CRH |= GPIO_CRH_MODE11;
  GPIOB->CRH |= GPIO_CRH_CNF11_0;
  GPIOB->CRH &= ~GPIO_CRH_CNF11_1;*/
}
//--------------------------------------------------
uint8_t ds18b20_Reset(void)
{
  uint8_t status;
  port_init;
  //GPIOB->ODR &= ~GPIO_ODR_ODR11;//низкий уровень
  GPIO_ResetBits(GPIOB, GPIO_Pin_11);
  delay_us(485);//задержка как минимум на 480 микросекунд
  //GPIOB->ODR |= GPIO_ODR_ODR11;//высокий уровень
  GPIO_SetBits(GPIOB, GPIO_Pin_11);
  delay_us(65);//задержка как минимум на 60 микросекунд
  //status = GPIOB->IDR & GPIO_IDR_IDR11;//проверяем уровень

  status = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_10);
  delay_us(500);//задержка как минимум на 480 микросекунд
  //(на всякий случай подождём побольше, так как могут быть неточности в задержке)
  return (status);//вернём результат
}
//----------------------------------------------------------
uint8_t ds18b20_ReadBit(void)
{
  uint8_t bit = 0;
  //GPIOB->ODR &= ~GPIO_ODR_ODR11;//низкий уровень
  GPIO_SetBits(GPIOB, GPIO_Pin_11);
  delay_us(2);
        //GPIOB->ODR |= GPIO_ODR_ODR11;//высокий уровень
        GPIO_ResetBits(GPIOB, GPIO_Pin_11);
        delay_us(17);
        bit = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_10);//проверяем уровень
        delay_us(45);
  //while (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_10) == Bit_RESET) ;
  return bit;
}
//-----------------------------------------------
uint8_t ds18b20_ReadByte(void)
{
  uint8_t data = 0;
  for (uint8_t i = 0; i <= 7; i++)
  data += ds18b20_ReadBit() << i;
  return data;
}
//-----------------------------------------------
void ds18b20_WriteBit(uint8_t bit)
{
  GPIO_ResetBits(GPIOB, GPIO_Pin_11);
  //GPIO_SetBits(GPIOB, GPIO_Pin_11);
  delay_us(bit ? 3 : 75);
  //GPIO_ResetBits(GPIOB, GPIO_Pin_11);
  GPIO_SetBits(GPIOB, GPIO_Pin_11);
  delay_us(bit ? 75 : 3);
}
//-----------------------------------------------
void ds18b20_WriteByte(uint8_t dt)
{
  for (uint8_t i = 0; i < 8; i++)
  {
    ds18b20_WriteBit(dt >> i & 1);
    //Delay Protection
    delay_us(5);

  }
}
//-----------------------------------------------
uint8_t ds18b20_init(uint8_t mode)
{
        if(ds18b20_Reset()) return 1;

  return 0;
}
//----------------------------------------------------------
void ds18b20_MeasureTemperCmd(uint8_t mode, uint8_t *commandID)
{
  ds18b20_Reset();

    //SKIP ROM
  ds18b20_WriteByte(0xCC);

  //CONVERT T
  ds18b20_WriteByte(0x44);
}
//----------------------------------------------------------
void ds18b20_ReadStratcpad(uint8_t mode, uint8_t *Data, uint8_t *commandID)
{
  uint8_t i;
  ds18b20_Reset();
  if(mode==SKIP_ROM)
  {
    //SKIP ROM
    ds18b20_WriteByte(0xCC);
  }
        else
        {
                //Match Rom
                ds18b20_WriteByte(0x55);
                for(i=0;i<=7;i++)
                {
                        ds18b20_WriteByte(commandID[i]);
                }
        }
  //READ SCRATCHPAD
  ds18b20_WriteByte(0xBE);
  for(i=0;i<8;i++)
  {
    Data[i] = ds18b20_ReadByte();
  }
}
//----------------------------------------------------------
uint8_t ds18b20_GetSign(uint16_t dt)
{
  //Проверим 11-й бит
  if (dt&(1<<11)) return 1;
  else return 0;
}
//----------------------------------------------------------
float ds18b20_Convert(uint16_t dt)
{
  float t;
  t = (float) ((dt&0x07FF)>>4); //отборосим знаковые и дробные биты
  //Прибавим дробную часть
  t += (float)(dt&0x000F) / 16.0f;
  return t;
}
